INSERT INTO albums (title, year_release) VALUES 
('Начальник камчатки', 1988),
('Звезда по имени Солнце', 1989),
('Последний герой', 1989),
('Группа крови', 1988),
('Посолонь', 2017),
('Цирк', 2018),
('The Circle', 2019),
('Галя ходи', 2020)


INSERT INTO collection (title, year_release) VALUES 
('Русский рок', 2018),
('Музыка в дорогу', 2019),
('Сборник рока', 2020),
('Хиты', 2014),
('Рок', 2015),
('Легенды рока', 2005),
('Хиты 90-х', 1999),
('Музыка', 2020)

INSERT INTO genre (title) VALUES 
('Рок'),
('Поп'),
('Авторская'),
('Метал'),
('Поп-рок')

INSERT INTO performers (name) VALUES 
('Цой'),
('Алиса'),
('КиШ'),
('ДДТ'),
('Пугачева'),
('Bon Jovi'),
('Высоцкий')

INSERT INTO tracks (title, times, albums_id) VALUES 
('Последний герой', '00:02:53', 1),
('Гость', '00:03:56', 1),
('Камчатка', '00:02:51', 1),
('Песня без слов', '00:05:07', 2),
('Звезда по имени Солнце', '00:03:46', 2),
('Апрель', '00:04:41', 2),
('Группа крови', '00:04:47', 4),
('Легенда', '00:04:09', 4),
('В наших глазах', '00:03:34', 4),
('Спокойная ночь', '00:06:24', 3),
('Мы ждем перемен', '00:04:55', 3),
('Март', '00:05:48', 5),
('Охота', '00:03:55', 6),
('It my life', '00:04:30', 7),
('Галя ходи', '00:05:07', 8)

INSERT INTO collectiontracks (collection_id, tracks_id) VALUES 
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(1, 7),
(1, 8),
(1, 9),
(1, 11),
(2, 12),
(2, 13),
(2, 14),
(2, 15),
(6, 6),
(6, 11),
(6, 3)

INSERT INTO genreperformers (performers_id, genre_id) VALUES 
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 2),
(7, 4),
(8, 3)


INSERT INTO performersalbums (performers_id, albums_id) VALUES 
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(2, 5),
(3, 6),
(7, 7),
(4, 8)